let str = " Может быть в 09:00 а может и в 19:00 но не 24:99 только 23:59 ";
let regexp = /(([01]\d)|(2[0-3])):([0-5]\d)/g;
alert(str.match(regexp));

let str2 = " было много чисел и 10 и 101 и 12.12 и -21 и 8 ";
let regexp2 = /-?\b\d{2}(.\d+)?\b/g;
alert(str2.match(regexp2));

let str3 = " +7(910)5961762 позвонил 8-800-555-35-35 ";
let regexp3 = /((\+7\(\d{3}\)\d{7}\s)|(8-\d{3}-\d{3}-\d{2}-\d{2}))/g;
alert(str3.match(regexp3));

let str4 = " Лекции по веб-разработке 12/02/2024 19/02/24 26.02.2024 04.03.24 11-03-2024 18-03-24 18/03.24 ";
let regexp4 = /(([0-2]\d)|(3[01]))[/.-]((0\d)|(1[0-2]))[/.-](\d{2}|\d{4})\s/g;
let regexp4_1 = /((([0-2]\d)|(3[01]))\/((0\d)|(1[0-2]))\/(\d{2}|\d{4})\s)|((([0-2]\d)|(3[01]))\.((0\d)|(1[0-2]))\.(\d{2}|\d{4})\s)|((([0-2]\d)|(3[01]))-((0\d)|(1[0-2]))-(\d{2}|\d{4})\s)/g;
alert(str4.match(regexp4));
alert(str4.match(regexp4_1));